app/controllers/xfiles_controller.rb

SELECT "xfiles".* FROM "xfiles"
---
  def index
    @xfiles = Xfile.all

INSERT INTO "xfiles" ("name", "content") VALUES (?, ?)  [["name", "sample1.json"], ["content", "{\"a\"=>\"b\"}"]]
---
  def create
    @xfile = params[:content].read
    @name = params[:content].original_filename
    @extension = @name.split('.').last
    if @extension == "json"
      @data = Crack::JSON.parse(@xfile)
      @xfile = Xfile.create!(xfile_params) do |xfile|